from configs import *
alphabet = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']
greeting_message = ("<b>Aссалому алайкум! 🤗</b>\n \n<b>Milliy TV</b> телеканалида ҳар куни эфирга узатиладиган <b>TV SALE</b> кўрсатувининг расмий ботига хуш келибсиз! 🌟")
user_name = "<b>Фамилия</b>, <b>Исм</b>, <b>Шарифингизни</b> киритинг 👇"
phone_send_btn = "Телефон рақамни жўнатиш ✅"
request_phone = "Илтимос, телефон рақамингизни жўнатинг 📲"
registration_complete_msg = "<b>Раҳмат!</b> 😁\n \nСиз ҳозиргина рўйхатдан муваффақиятли ўтдингиз ва <b>TV SALE оиласига</b> расман қўшилдингиз! 😍"
main_menu_text = "Асосий меню:"
clients_choose_text = "Қуйидагилардан бирини танланг: 👇"
back_to_menu_text = "Асосий менюга қайтдингиз 🔄"
