from configs import *
alphabet = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']
greeting_message = ("<b>Aссалому алайкум! 🤗</b>\n \n<b>Milliy TV</b> телеканалида ҳар куни эфирга узатиладиган <b>TV SALE</b> кўрсатувининг расмий ботига хуш келибсиз! 🌟")
user_name = "<b>Фамилия</b>, <b>Исм</b>, <b>Шарифингизни</b> киритинг 👇"
phone_send_btn = "Телефон рақамни жўнатиш ✅"
request_phone = "Илтимос, телефон рақамингизни жўнатинг 📲"
registration_complete_msg = "<b>Раҳмат!</b> 😁\n \nСиз ҳозиргина рўйхатдан муваффақиятли ўтдингиз ва <b>TV SALE оиласига</b> расман қўшилдингиз! 😍"
main_menu_text = "Асосий меню:"
clients_choose_text = "Қуйидагилардан бирини танланг: 👇"
back_to_menu_text = "Асосий менюга қайтдингиз 🔄"
for_sponsors_text = """⚡️ <b>Ҳамёнбоп ва кенг қамровли телереклама керак бўлса, хизматингиздамиз!</b>

📺 Ҳар бир бизнес эгаси ўзи асос солган ёки раҳбарлик қилаётган корхонасининг маҳсулоти ёки хизматини телевиденияда реклама қилдириш нияти бўлади, албатта. Мана ҳозир бунинг айни вақти!

🤗 Ўзбекистонда юқори рейтингда турувчи <b>«Milliy TV»</b> телеканалида ҳар куни икки махал намойиш этилувчи <b>«TV SALE»</b> кўрсатувимизнинг эшиклари, тижорий келишувлар учун доим очиқ!

📲 Ҳамкорлик учун @nuriddin_i ёки
+998 99 878-99-07 телефон рақамига мурожаат қилинг!"""
reset_text = """<b>Мен ухлаб қолдим😴😴😴...</b>\n \nМени /start командаси билан уйғотинг!"""
about_text = """<b>«TV SALE» кўрсатуви ҳақида!</b>

🤗 Телекўрсатувимиз 2017-чи йилдан буён <b>«Milliy TV»</b> телеканалида мунтазам тарзда эфирга узатилиб келинади. Шу ўтган давр мобайнида кўрсатувимиз ўзининг доимий мухлисларига эга бўлиб улгургани эътиборга лойиқ, албатта.

 ❤️ Доимий равишда томошабинларга ҳар куни икки маҳал фойдали маслаҳатларни бериш учун ижодий жамоамиз тинимсиз ҳаракатда.

🤝 Жуда кўп, катта ва кичик тадбиркорлик субъектлари кўрсатувимизга реклама бериш натижасида, ўз маҳсулот ёки хизматларининг сотувини ошириб олишган. Шунингдек, биз реклама қилувчи ҳар бир маҳсулот ва хизмат турининг сифатли эканлигига катта эътибор қаратамиз. Сабаби, бизнинг қадрли теле-мухлисларимиз учун фақат синовдан ўтган, аъло даражадаги маҳсулот ёки хизматни тавсия этишимиз кераклигини яхши ҳис этамиз.

<b>Эътиборингиз учун раҳмат!</b>"""
feedback_text = "✍️  Кўрсатувимиз бўйича бирор фикрингиз, шикоятингиз, тилак ёки таклифларингиз бўлса,\n \n⬇️ Қуйида ёзиб қолдиринг."
promo_text = "Ҳозирча промо-кодлар мавжуд эмас.\n \nАммо, тез орада пайдо бўлади... 😉"
error_message = "Серверимизда хатолик юз берди... \n \nБироздан сўнг қайта уриниб кўринг."