from configs import *
import time
alphabet = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']
greeting_message = "<b>Aссалому алайкум! 🤗</b>\n \n<b>Milliy TV</b> телеканалида ҳар куни эфирга узатиладиган <b>TV SALE</b> кўрсатувининг расмий ботига хуш келибсиз! 🌟"
registration_start_txt = '''Биз сиз билан яқиндан танишмаган эканмиз 😥

Келинг, буни тўғирлаймиз 🤗

Бунинг учун <b>Фамилия</b> ва <b>Исмингизни</b> ёзинг 👇'''
please_full_name = '⚠️ Илтимос, Фамилия ва Исмингизни тўлиқ киритинг...'
name_with_capitals = '⚠️ Фамилия ва Исм катта харф билан бошланиши керак'
phone_send_btn = "Телефон рақамни жўнатиш 📲"
accepted_name_txt = "Қабул қилинди! 😃"
request_phone = """<b>{}</b>, бизнинг базада телефон рақамингиз топилмади...

Илтимос, телефон рақамингизни +998 ** *** ** ** форматида ёзинг ёки қуйидаги тугма орқали юборинг 📲"""
correct_phone_text = '''⚠️ Телефон рақамни тўғри форматда киритинг.

<i>Масалан: +998901234567</i>'''
registration_complete_msg = "<b>Раҳмат!</b> 😁\n \nСиз ҳозиргина рўйхатдан муваффақиятли ўтдингиз ва <b>TV SALE оиласига</b> расман қўшилдингиз! 😍"
main_menu_text = "Асосий меню:"
help_text = """Салом!

Мен сизга кўрсатувимизда эфирга узатиладиган маҳсулот ва хизматларнинг телефон рақамларини ва улар ҳақидаги маълумотларни беришда ёрдам бераман!

Бунинг учун шунчаки /start тугмасини босиб "Aсосий меню"дан "Маҳсулот ва хизматлар" тугмасини босинг!"""
clients_choose_text = "Қуйидагилардан бирини танланг: 👇"
back_to_menu_text = "Асосий менюга қайтдингиз 🔄"
for_sponsors_text = """⚡️ <b>Ҳамёнбоп ва кенг қамровли телереклама керак бўлса, хизматингиздамиз!</b>

📺 Ҳар бир бизнес эгаси ўзи асос солган ёки раҳбарлик қилаётган корхонасининг маҳсулоти ёки хизматини телевиденияда реклама қилдириш нияти бўлади, албатта. Мана ҳозир бунинг айни вақти!

🤗 Ўзбекистонда юқори рейтингда турувчи <b>«Milliy TV»</b> телеканалида ҳар куни икки махал намойиш этилувчи <b>«TV SALE»</b> кўрсатувимизнинг эшиклари, тижорий келишувлар учун доим очиқ!

📲 Ҳамкорлик учун @nuriddin_i ёки
+998 99 878-99-07 телефон рақамига мурожаат қилинг!"""
reset_texts = ('<b>Мен ухлаб қолдим😴😴😴...</b>\n \nМени /start командаси билан уйғотинг!',
               'Айнан ҳозир сизга /start командаси ёрдам беради 🥰',
               '/start ни босинг, ва ботимиздан фойдаланишда давом этинг 🏃',
               'Йўқ-йўқ, бу хатолик эмас. Шунчаки /start деб юборсангиз бу бот сайраб юборади 🤖')
about_text = """<b>«TV SALE» кўрсатуви ҳақида!</b>

🤗 Телекўрсатувимиз 2017-чи йилдан буён <b>«Milliy TV»</b> телеканалида мунтазам тарзда эфирга узатилиб келинади. Шу ўтган давр мобайнида кўрсатувимиз ўзининг доимий мухлисларига эга бўлиб улгургани эътиборга лойиқ, албатта.

 ❤️ Доимий равишда томошабинларга ҳар куни икки маҳал фойдали маслаҳатларни бериш учун ижодий жамоамиз тинимсиз ҳаракатда.

🤝 Жуда кўп, катта ва кичик тадбиркорлик субъектлари кўрсатувимизга реклама бериш натижасида, ўз маҳсулот ёки хизматларининг сотувини ошириб олишган. Шунингдек, биз реклама қилувчи ҳар бир маҳсулот ва хизмат турининг сифатли эканлигига катта эътибор қаратамиз. Сабаби, бизнинг қадрли теле-мухлисларимиз учун фақат синовдан ўтган, аъло даражадаги маҳсулот ёки хизматни тавсия этишимиз кераклигини яхши ҳис этамиз.

<b>Эътиборингиз учун раҳмат!</b>"""
feedback_text = "✍️  Кўрсатувимиз бўйича бирор фикрингиз, шикоятингиз, тилак ёки таклифларингиз бўлса,\n \n⬇️ Қуйида ёзиб қолдиринг."
feedback_accepted_text = "Мурожаатингиз қабул қилинди, тез орада сиз билан қайта боғланамиз 🤗"
promo_text = "Ҳозирча промо-кодлар мавжуд эмас.\n \nАммо, тез орада пайдо бўлади... 😉"
error_message = "Серверимизда хатолик юз берди... \n \nБироздан сўнг қайта уриниб кўринг."


# --------------------- ID_1 SECTION --------------------- #
id1_info = """🧬 Лактовита - <b>100% табиий</b>, сигир оғиз сутидан тайёрланган маҳсулот.

🔷 Лактовита маҳсулоти бугунги кунда қуйидаги касалликларда самарали қўлланилмоқда:
- юрак-қон томир касалликлари;
- жигар касалликлари;
- хазм қилиш тизими касалликлари;
- насаф олиш тизими касалликлари;
- асаб тизими касалликлари;
- иммун тизими касалликлари;
- эндокрин касалликлар, жумладан, қандли диабет;
- артрит, полиартрит, остеохондроз;
- юқори қон босими ва бошқалар.

✅ Лактовита маҳсулоти табиий бўлганлиги учун барча ёшдаги инсонлар томонидан истеъмол қилиниши мумкин.

📜 <i>Маҳсулот Ўзбекистон Республикаси Соғлиқни Сақлаш Вазирлиги томинадан тасдиқланган.</i>

☎️ Лактовита маҳсулоти хақида батафсил маълумот олиш учун <b>71 230 80 08</b> рақамига қўнғироқ қилинг ва буюртма беринг.

<b>Лактовита - табиатнинг шифобаҳш сири</b>"""
id1_social = """<b>Бизнинг инстаграм саҳифамиз:</b>
https://www.instagram.com/lactovita.uz/?hl=ru

<b>Бизнинг YouTube каналимиз:</b>
https://www.youtube.com/channel/UCE7e-Sh_8jopefC7S99V3Eg

<b>Бизнинг Телеграм каналимиз:</b>
https://t.me/lactovita

<b>Бизнинг веб-сайтимиз:</b>
http://lactovita.uz/"""
id1_contact = "Маҳсулот бўйича саволингиз ёки таклифингиз бўлса шу ерга ёзинг: 👇"
accepted_id1 = """<b>Қабул қилинди! ✅</b>

Тез орада операторларимиз Сиз билан боғланишади.

Мурожаатингиз учун раҳмат, <b>{}</b>."""
# ---------------------- ADMIN LIBRARY ---------------------- #
